Revit 2027 API
MacroModule.MacroManager Property
 The Macro manager.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroManager MacroManager { get; }
Public ReadOnly Property MacroManager As MacroManager
	Get
public:
property MacroManager^ MacroManager {
	MacroManager^ get ();
}
member MacroManager : MacroManager with get
Property Value
MacroManager
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace